In [1]:
import numpy as np
import pandas as pd

In [2]:
index = [('California',2000),('California',2010),
        ('New York',2000),('New York',2010),
        ('Texas',2000),('Texas',2010)]
populations =[33871648,37253956,
             18976457,19378102,
             20851820,25145561]
pop = pd.Series(populations,index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [3]:
index = pd.MultiIndex.from_tuples(index)#创建多级索引
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [4]:
pop = pd.Series(populations,index=index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [12]:
pop[:,2000]

California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [14]:
pop_df = pop.unstack()#将多级索引转化为普通索引的DataFrame //使用pop_df.stack()可以实现 DataFrame==> MultiIndex转化
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [15]:
pop_df = pd.DataFrame({'total':pop,'under18':[9267089,9284094,
                                             4687374,4318033,
                                             5906301,68779014]})
pop_df

                    total   under18
California 2000  33871648   9267089
           2010  37253956   9284094
New York   2000  18976457   4687374
           2010  19378102   4318033
Texas      2000  20851820   5906301
           2010  25145561  68779014

In [18]:
f_u18 = pop_df['under18'] / pop_df['total']  #多级索引形式
f_u18
#pop_df['under18']
#pop_df['total']

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    2.735235
dtype: float64

In [19]:
f_u18.unstack()#转换为DataFrame

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  2.735235

In [20]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [24]:
pop.index.names = ['省','年份'] #给索引加名字 ‘为等级设置名称’
pop

省           年份
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [36]:
data = np.round(np.random.randn(4,6),1)# round(x,)方法返回浮点数x的四舍五入值
#print(data)
data[:,::2] *= 10
#print(data)
data+=37
#np.random.randn(4,6)

In [37]:
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['years','visit'])#行
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],names=['subject','type'])
health_data = pd.DataFrame(data,index=index,columns=columns)
health_data

subject       Bob       Guido         Sue
type           HR  Temp    HR  Temp    HR  Temp
years visit
2013  1      36.0  37.2  38.0  37.6  60.0  36.3
      2      48.0  36.2  35.0  36.8  44.0  37.3
2014  1      30.0  36.5  30.0  36.5  42.0  37.1
      2      35.0  38.5  38.0  36.9  29.0  37.4

In [40]:
health_data['Guido']

type           HR  Temp
years visit
2013  1      38.0  37.6
      2      35.0  36.8
2014  1      30.0  36.5
      2      38.0  36.9

In [41]:
pop

省           年份
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [44]:
pop.iloc[0:2]

省           年份
California  2000    33871648
            2010    37253956
dtype: int64

In [45]:
pop[['Texas']]

省      年份
Texas  2000    20851820
       2010    25145561
dtype: int64

In [46]:
health_data.loc[:,('Bob','HR')]

years  visit
2013   1        36.0
       2        48.0
2014   1        30.0
       2        35.0
Name: (Bob, HR), dtype: float64